#pragma once

#include <stdint.h>

#include "HardwareSerial.h"
#include "avr/interrupt.h"

#undef min
#undef max
#undef clamp
#undef cli
#undef sei

//#define __flash PROGMEM

namespace Tuna
{
	using uint8 = uint8_t;
	using uint16 = uint16_t;
	using uint24 = __uint24;
	using uint32 = uint32_t;
	using uint64 = uint64_t;
	using int8 = int8_t;
	using int16 = int16_t;
	using int24 = __int24;
	using int32 = int32_t;
	using int64 = int64_t;

  // sanity checks
  static_assert(sizeof(uint8) == 1);
  static_assert(sizeof(int8) == 1);
  static_assert(sizeof(uint16) == 2);
  static_assert(sizeof(int16) == 2);
  static_assert(sizeof(uint24) == 3);
  static_assert(sizeof(int24) == 3);
  static_assert(sizeof(uint32) == 4);
  static_assert(sizeof(int32) == 4);
  static_assert(sizeof(uint64) == 8);
  static_assert(sizeof(int64) == 8);

  static_assert(alignof(uint8) == 1);
  static_assert(alignof(int8) == 1);
  static_assert(alignof(uint16) == 1);
  static_assert(alignof(int16) == 1);
  static_assert(alignof(uint24) == 1);
  static_assert(alignof(int24) == 1);
  static_assert(alignof(uint32) == 1);
  static_assert(alignof(int32) == 1);
  static_assert(alignof(uint64) == 1);
  static_assert(alignof(int64) == 1);

#if !defined(__INTELLISENSE__)
	static_assert(sizeof(int) == 2, "atmega int is 2 bytes. Utils need to be rewritten for other sizes.");
#endif
	using uint = uint16;

	constexpr uint8 operator"" _u8(unsigned long long int value)
	{
		// static_assert(value > uint8(-1), "out of range u8 literal");
		return value;
	}

	constexpr int8 operator"" _i8(unsigned long long int value)
	{
		// static_assert(value > uint8(-1), "out of range u8 literal");
		return value;
	}

	constexpr uint16 operator"" _u16(unsigned long long int value)
	{
		// static_assert(value > uint8(-1), "out of range u8 literal");
		return value;
	}

	constexpr int16 operator"" _i16(unsigned long long int value)
	{
		// static_assert(value > uint8(-1), "out of range u8 literal");
		return value;
	}

	constexpr uint24 operator"" _u24(unsigned long long int value)
	{
		// static_assert(value > uint8(-1), "out of range u8 literal");
		return value;
	}

	constexpr int24 operator"" _i24(unsigned long long int value)
	{
